/* root */

jacketroot = "source/jacket/";
profileimgroot = "source/profile/";
pfpcircleload = "_원형프로필";

filetypewebp = ".webp",
filetypepng = ".png";

/* opening & closing */

tableopening = "<tr>";
tableclosing = "</tr>";

divopening = "<div>";
divopening = "</div>";

/* members */

tsukasa = "츠카사";
emu = "에무";
nene = "네네";
rui = "루이";

wxs = "원더쇼";

miku = "미쿠";
rin = "린";
len = "렌";
luka = "루카";
meiko = "메이코";
kaito = "카이토";

/* more vocaloids */

vGumi = '<div class="vocaloid"><p class="gumi">GUMI</p></div>';
vUna = '<div class="vocaloid"><p class="una">오토마치 우나</p></div>';
vflower = '<div class="vocaloid"><p class="vflower">flower</p></div>';
vIA = '<div class="vocaloid"><p class="ia">IA</p></div>';
vYuki = '<div class="vocaloid"><p class="yuki">카아이 유키</p></div>';
vTeto = '<div class="vocaloid"><p class="teto">카사네 테토</p></div>';

/* release */

initial = "초기 수록";
yet = "-"

const wxsCoverList = {
    songName : {
        a001: "브리키노 댄스",
        a002: "스위트 매직",
        a003: "모험의 서가 사라졌습니다!",
        a004: "탈법 록",
        a005: "댄스 로봇 댄스",
        a006: "미라클 페인트",
        a007: "츄루리라·츄루리라·땃땃따!",
        a008: "포지티브☆댄스 타임",
        a009: "마음에 드시는 대로",
        a010: "KING",
        a011: "텔레캐스터 비보이",
        a012: "픽서",
        a013: "난센스 문학",
        a014: "이얼 팬클럽",
        a015: "리모컨",
        a016: "신의 뜻대로",
        a017: "굿바이 선언",
        a018: "에일리언 에일리언",
        a019: "춤춰라 오케스트라",
        a020: "에고 록",
        a021: "라브카?",
        a022: "온라인 게임 폐인 슈프레히코어",
        a023: "1925",
        a024: "어린이 전쟁",
        a025: "아아, 훌륭한 고양이의 삶",
        a026: "태양계 디스코",
        a027: "좋아하는 것만으로도 괜찮아요",
        a028: "제멋대로 공주",
        a029: "강풍 올백",
        a030: "고서저택 살인사건",
        a031: "1000년 살고 있어",
        a032: "장난기 기능",
        a033: "오늘도 상쾌하게",
        a034: "QUEEN",
        a035: "달라!!!",
        a036: "전생사과",
        a037: "혼돈 부기",
        a038: "중병격발 보이",
        a039: "라이어 댄서",
        a040: "도레미파 론도",
        a041: "이 실없이 멋진 세계는, 나를 위해 있어",
        a042: "",
        a043: "",
        a044: "",
        a045: "",
        a046: "",
        a047: "",
        a048: "",
        a049: "",
        a050: ""
    },

    coverJacket : {
        b001: "브리키노댄스",
        b002: "스위트매직",
        b003: "모험의서",
        b004: "탈법록",
        b005: "댄스로봇댄스",
        b006: "미라클페인트",
        b007: "츄루리라",
        b008: "포지티브댄스",
        b009: "마음에드시는대로",
        b010: "KING",
        b011: "텔레캐스터비보이",
        b012: "픽서",
        b013: "난센스문학",
        b014: "이얼팬클럽",
        b015: "리모컨",
        b016: "신의뜻대로",
        b017: "굿바이선언",
        b018: "에일리언에일리언",
        b019: "춤춰라오케스트라",
        b020: "에고록",
        b021: "라브카",
        b022: "넷게임슈프레히코어",
        b023: "1925",
        b024: "어린이전쟁",
        b025: "냥생",
        b026: "태양계디스코",
        b027: "스키나코토",
        b028: "제멋대로공주",
        b029: "강풍올백",
        b030: "고서저택살인사건",
        b031: "천년살고있어",
        b032: "장난기기능",
        b033: "오늘도상쾌하게",
        b034: "퀸",
        b035: "치가우",
        b036: "전생사과",
        b037: "혼돈부기",
        b038: "중병격발보이",
        b039: "라이어댄서",
        b040: "도레미파론도",
        b041: "실없세",
        b042: "sample",
        b043: "sample",
        b044: "sample",
        b045: "sample",
        b046: "sample",
        b047: "sample",
        b048: "sample",
        b049: "sample",
        b050: "sample"
    },

/*     coverMember : {
        c001: tsukasa+rui+wxs+len,
        c002: "",
        c003: "",
        c004: "",
        c005: "",
        c006: "",
        c007: "",
        c008: "",
        c009: "",
        c010: "",
        c011: "",
        c012: "",
        c013: "",
        c014: "",
        c015: "",
        c016: "",
        c017: "",
        c018: "",
        c019: "",
        c020: "",
        c021: "",
        c022: "",
        c023: "",
        c024: "",
        c025: "",
        c026: "",
        c027: "",
        c028: "",
        c029: "",
        c030: "",
        c031: "",
        c032: "",
        c033: "",
        c034: "",
        c035: "",
        c036: "",
        c037: "",
        c038: "",
        c039: "",
        c040: "",
        c041: "",
        c042: "",
        c043: "",
        c044: "",
        c045: "",
        c046: "",
        c047: "",
        c048: "",
        c049: "",
        c050: ""
    }, */

    releaseDate : {
        d001: "초기 수록",
        d002: "초기 수록",
        d003: "초기 수록",
        d004jp: "2020. 10. 04",
        d004kr: "초기 수록",
        d005jp: "2020. 10. 07",
        d005kr: "초기 수록",
        d006jp: "2020. 10. 13",
        d006kr: "초기 수록",
        d007jp: "2021. 01. 03",
        d007kr: "2022. 05. 31",
        d008jp: "2021. 02. 19",
        d008kr: "2022. 06. 09",
        d009jp: "2021. 04. 05",
        d009kr: "2022. 06. 17",
        d010jp: "2021. 05. 17",
        d010kr: "2022. 06. 26",
        d011jp: "2021. 10. 06",
        d011kr: "2022. 08. 24",
        d012jp: "2021. 12. 28",
        d012kr: "2022. 11. 26",
        d013jp: "2022. 02. 24",
        d013kr: "2023. 02. 27",
        d014jp: "2022. 03. 14",
        d014kr: "2023. 02. 14",
        d015jp: "2022. 05. 16",
        d015kr: "2023. 05. 18",
        d016jp: "2022. 05. 30",
        d016kr: "2023. 04. 24",
        d017jp: "2022. 06. 13",
        d017kr: "2023. 06. 13",
        d018jp: "2022. 07. 11",
        d018kr: "2023. 07. 11",
        d019jp: "2022. 08. 08",
        d019kr: "2023. 08. 08",
        d020jp: "2022. 10. 06",
        d020kr: "2023. 05. 26",
        d021jp: "2022. 11. 14",
        d021kr: "2023. 11. 14",
        d022jp: "2022. 12. 30",
        d022kr: "2023. 12. 30",
        d023jp: "2023. 02. 15",
        d023kr: "2024. 04. 10",
        d024jp: "2023. 04. 17",
        d024kr: "2024. 04. 17",
        d025jp: "2023. 06. 16",
        d025kr: "2024. 05. 29",
        d026jp: "2023. 07. 12",
        d026kr: "2024. 07. 12",
        d027jp: "2023. 10. 08",
        d027kr: "2024. 10. 08",
        d028jp: "2023. 10. 25",
        d028kr: "2024. 10. 25",
        d029jp: "2024. 01. 01",
        d029kr: "2025. 01. 01",
        d030jp: "2024. 02. 22",
        d030kr: "2025. 02. 22",
        d031jp: "2024. 03. 25",
        d031kr: "2025. 03. 25",
        d032jp: "2024. 05. 07",
        d032kr: "2025. 05. 02",
        d033jp: "2024. 06. 10",
        d033kr: "2025. 06. 10",
        d034jp: "2024. 08. 26",
        d034kr: "-",
        d035jp: "2024. 09. 02",
        d035kr: "-",
        d036jp: "2024. 10. 07",
        d036kr: "-",
        d037jp: "2024. 12. 29",
        d037kr: "-",
        d038jp: "2025. 01. 14",
        d038kr: "-",
        d039jp: "2025. 03. 10",
        d039kr: "-",
        d040jp: "2025. 03. 24",
        d040kr: "-",
        d041jp: "2025. 06. 09",
        d041kr: "-",
        d042jp: "",
        d042kr: "",
        d043jp: "",
        d043kr: "",
        d044jp: "",
        d044kr: "",
        d045jp: "",
        d045kr: "",
        d046jp: "",
        d046kr: "",
        d047jp: "",
        d047kr: "",
        d048jp: "",
        d048kr: "",
        d049jp: "",
        d049kr: "",
        d050jp: "",
        d050kr: ""
    },

    level : {
        e001a: "5", e001b: "13", e001c: "18", e001d: "25", e001e: "30",
        e002a: "5", e002b: "12", e002c: "18", e002d: "24", e002e: "27", e002f: "25",
        e003a: "8", e003b: "13", e003c: "19", e003d: "26", e003e: "31",
        e004a: "7", e004b: "13", e004c: "18", e004d: "26", e004e: "31",
        e005a: "8", e005b: "13", e005c: "18", e005d: "26", e005e: "30",
        e006a: "9", e006b: "12", e006c: "18", e006d: "25", e006e: "30",
        e007a: "9", e007b: "13", e007c: "18", e007d: "26", e007e: "31",
        e008a: "9", e008b: "14", e008c: "18", e008d: "26", e008e: "31",
        e009a: "6", e009b: "12", e009c: "18", e009d: "24", e009e: "29",
        e010a: "7", e010b: "14", e010c: "19", e010d: "25", e010e: "30", e010f: "28",
        e011a: "8", e011b: "13", e011c: "18", e011d: "25", e011e: "29", e011f: "31",
        e012a: "6", e012b: "12", e012c: "19", e012d: "26", e012e: "32",
        e013a: "7", e013b: "11", e013c: "18", e013d: "25", e013e: "29",
        e014a: "6", e014b: "12", e014c: "17", e014d: "24", e014e: "28", e014f: "26",
        e015a: "7", e015b: "12", e015c: "17", e015d: "24", e015e: "29",
        e016a: "6", e016b: "13", e016c: "18", e016d: "25", e016e: "29",
        e017a: "7", e017b: "12", e017c: "17", e017d: "26", e017e: "30", e017f: "27",
        e018a: "7", e018b: "12", e018c: "18", e018d: "25", e018e: "29",
        e019a: "8", e019b: "12", e019c: "17", e019d: "24", e019e: "28",
        e020a: "9", e020b: "13", e020c: "18", e020d: "25", e020e: "31",
        e021a: "6", e021b: "12", e021c: "17", e021d: "25", e021e: "29",
        e022a: "8", e022b: "13", e022c: "18", e022d: "25", e022e: "31",
        e023a: "6", e023b: "11", e023c: "17", e023d: "24", e023e: "28",
        e024a: "8", e024b: "13", e024c: "18", e024d: "27", e024e: "31",
        e025a: "8", e025b: "13", e025c: "18", e025d: "24", e025e: "29",
        e026a: "7", e026b: "13", e026c: "17", e026d: "23", e026e: "28",
        e027a: "6", e027b: "12", e027c: "18", e027d: "26", e027e: "31",
        e028a: "6", e028b: "11", e028c: "18", e028d: "26", e028e: "30",
        e029a: "6", e029b: "13", e029c: "17", e029d: "24", e029e: "28",
        e030a: "6", e030b: "12", e030c: "18", e030d: "24", e030e: "28",
        e031a: "5", e031b: "13", e031c: "18", e031d: "23", e031e: "28",
        e032a: "7", e032b: "13", e032c: "18", e032d: "24", e032e: "30",
        e033a: "6", e033b: "13", e033c: "17", e033d: "24", e033e: "28",
        e034a: "8", e034b: "13", e034c: "18", e034d: "25", e034e: "29",
        e035a: "8", e035b: "13", e035c: "18", e035d: "26", e035e: "31",
        e036a: "6", e036b: "12", e036c: "20", e036d: "25", e036e: "29",
        e037a: "9", e037b: "14", e037c: "19", e037d: "25", e037e: "30", e037f: "33",
        e038a: "9", e038b: "13", e038c: "19", e038d: "27", e038e: "32",
        e039a: "7", e039b: "13", e039c: "18", e039d: "26", e039e: "31",
        e040a: "6", e040b: "12", e040c: "17", e040d: "23", e040e: "27",
        e041a: "7", e041b: "14", e041c: "17", e041d: "25", e041e: "29",
        e042a: "-", e042b: "-", e042c: "-", e042d: "-", e042e: "-",
        e043a: "-", e043b: "-", e043c: "-", e043d: "-", e043e: "-",
        e044a: "-", e044b: "-", e044c: "-", e044d: "-", e044e: "-",
        e045a: "-", e045b: "-", e045c: "-", e045d: "-", e045e: "-",
        e046a: "-", e046b: "-", e046c: "-", e046d: "-", e046e: "-",
        e047a: "-", e047b: "-", e047c: "-", e047d: "-", e047e: "-",
        e048a: "-", e048b: "-", e048c: "-", e048d: "-", e048e: "-",
        e049a: "-", e049b: "-", e049c: "-", e049d: "-", e049e: "-",
        e050a: "-", e050b: "-", e050c: "-", e050d: "-", e050e: "-"
    },

}

const keys = new Set([
    ...Object.keys(wxsCoverList.songName),
    ...Object.keys(wxsCoverList.coverJacket),
    ...Object.keys(wxsCoverList.releaseDate),
    ...Object.keys(wxsCoverList.level)
]);

keys.forEach(key => {
    const coverJacketElement = document.getElementById(key);
    const songNameElement = document.getElementById(key);
    const releaseDateElement = document.getElementById(key);
    const levelElement = document.getElementById(key);

    if (wxsCoverList.coverJacket[key] && coverJacketElement) {
        const imgElement = document.getElementById(key);
        if (imgElement) {
            const filename = wxsCoverList.coverJacket[key];
            imgElement.src = `source/jacket/${filename}.webp`;
        }
    }

    if (wxsCoverList.songName[key] && songNameElement) {
        document.getElementById(key).textContent = wxsCoverList.songName[key];
    }

    if (wxsCoverList.releaseDate[key] && releaseDateElement) {
        document.getElementById(key).textContent = wxsCoverList.releaseDate[key]
    }

    if (wxsCoverList.level[key] && levelElement) {
        document.getElementById(key).textContent = wxsCoverList.level[key]
    }
});